{
  "exported_at": "2025-12-31T01:10:20.515366",
  "statistics": {
    "total_jobs": 17,
    "total_variants": 3,
    "total_applications": 0,
    "applications_by_status": {},
    "avg_ats_score": 62.68
  },
  "jobs": [
    {
      "job_id": 12,
      "company": "Infosys",
      "job_title": "Python Developer",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4334764177",
      "job_description": "Python A day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction. You will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain. You will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews. You will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology Basics of Architecture and Design fundamentals Knowledge of Testing tools Knowledge of agile methodologies Understanding of Project life cycle activities on development and maintenance projects Understanding of one or more Estimation methodologies, Knowledge of Quality processes Basics of business domain to understand the business requirements Analytical abilities, Strong Technical Skills, Good communication skills Good understanding of the technology and domain Ability to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods Awareness of latest technologies and trends Excellent problem solving, analytical and debugging skills",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-20",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 13,
      "company": "Infosys",
      "job_title": "Python Developer",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4321582716",
      "job_description": "Primary skills:Python,Technology->Geographical Information System->Spatial Databases->SQL Server A day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction. You will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain. You will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews. You will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology Basics of Architecture and Design fundamentals Knowledge of Testing tools Knowledge of agile methodologies Understanding of Project life cycle activities on development and maintenance projects Understanding of one or more Estimation methodologies, Knowledge of Quality processes Basics of business domain to understand the business requirements Analytical abilities, Strong Technical Skills, Good communication skills Good understanding of the technology and domain Ability to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods Awareness of latest technologies and trends Excellent problem solving, analytical and debugging skills",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-22",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 14,
      "company": "Infosys",
      "job_title": "Python Developer",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4326022443",
      "job_description": "Primary skills:Domain->Finacle Treasury->Structured Products->Grand Master,Domain->Turbomachinery->Steam Turbine->Rotor,Technology->Geographical Information System->Spatial Databases->SQL Server,Technology->Machine Learning->Python,Technology->OpenSystem->Python - OpenSystem A day in the life of an Infoscion As part of the Infosys Delivery team, you will work on implementing designs, developing high quality programs and systems, partnering with our clients to ensure high quality deliverables. You will create technical artifacts and be the first point of contact in responding to production issues and conducting any technical analysis to arrive at solutions You will share your learnings from projects through knowledge management initiatives and leverage knowledge from other projects to drive high efficiency and effectiveness You will be a key contributor to building efficient programs/systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Advanced conceptual understanding of at least one Programming Language Advanced conceptual understanding of one database and one Operating System Understanding of Software Engineering with practice in at least one project Ability to contribute in medium to complex tasks independently Exposure to Design Principles and ability to understand Design Specifications independently Ability to run Test Cases and scenarios as per the plan Ability to accept and respond to production issues and coordinate with stake holders Good understanding of SDLC Analytical abilities Logical thinking Awareness of latest technologies and trends",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-27",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 15,
      "company": "Infosys",
      "job_title": "Python Devloper",
      "job_url": "https://in.linkedin.com/jobs/view/python-devloper-at-infosys-4321573434",
      "job_description": "Primary skills:Python,Technology->Geographical Information System->Spatial Databases->SQL Server A day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to interface with the client for quality assurance, issue resolution and ensuring high customer satisfaction. You will understand requirements, create and review designs, validate the architecture and ensure high levels of service offerings to clients in the technology domain. You will participate in project estimation, provide inputs for solution delivery, conduct technical risk planning, perform code reviews and unit test plan reviews. You will lead and guide your teams towards developing optimized high quality code deliverables, continual knowledge management and adherence to the organizational guidelines and processes. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of more than one technology Basics of Architecture and Design fundamentals Knowledge of Testing tools Knowledge of agile methodologies Understanding of Project life cycle activities on development and maintenance projects Understanding of one or more Estimation methodologies, Knowledge of Quality processes Basics of business domain to understand the business requirements Analytical abilities, Strong Technical Skills, Good communication skills Good understanding of the technology and domain Ability to demonstrate a sound understanding of software quality assurance principles, SOLID design principles and modelling methods Awareness of latest technologies and trends Excellent problem solving, analytical and debugging skills",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-22",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 16,
      "company": "Microsoft",
      "job_title": "Software Engineer",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4346187428",
      "job_description": "Overview Are you excited by the idea of shaping how Microsoft builds and operates cloud services at global scale? In this role, you will join a team at the heart of Microsoft Azure, helping power the operational framework that every Microsoft cloud service and engineering tool depends on. You will contribute to a company-wide platform that includes the software inventory system integrated with Microsoft's internal engineering ecosystem, along with an operational intelligence solution that delivers a complete, 360-degree view of the security, privacy, compliance, and reliability of every piece of software Microsoft ships. Your work will directly enable the company to deliver secure, resilient, and trusted cloud services to millions of customers worldwide. As a Software Engineer, you will work alongside a highly skilled, collaborative, and fast-moving team that thrives on solving complex problems, iterating quickly, and delivering meaningful business value. You will work with modern Azure services and data technologies to build scalable, innovative, and impactful solutions that sit at the core of Microsoft's cloud. This role will accelerate your technical growth, strengthen your engineering fundamentals, and give you opportunities to think creatively and influence systems used across the company. You will join a culture grounded in inclusivity, diverse perspectives, empathy, trust, and shared ownership. Your ideas will matter, your voice will be heard, and your work will help shape products and experiences that enable Microsoft and its customers to achieve more every day. Microsoft's mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. Responsibilities Write, review, and improve code for product features while applying secure coding practices, maintainable design patterns, and guidance gathered through code reviews from more experienced engineers. Use debugging tools, logs, telemetry, and automated source analysis tools to identify issues early, support proactive detection, and participate in incident retrospectives to understand root causes. Contribute to design discussions by exploring options, creating simple prototypes to validate approaches, and considering performance, scalability, resiliency, and cost of goods sold (COGS) in solution planning. Support testing strategies by building testable code, preventing regressions, and using artificial intelligence (AI) tools for test automation under supervision. Help ensure engineering excellence by upholding security, privacy, accessibility, compliance standards, and participating in secure design reviews, deployment gate checks, and monitoring improvements. Assist in feature delivery by breaking down work items, following safe deployment practices such as controlled flighting and rollback planning, and helping build deployment environments that mirror production systems. Participate in live-site operations as a designated responsible individual (DRI) for simple issues, responding within service level agreement (SLA) expectations, escalating when needed, and contributing improvements to troubleshooting guides, telemetry, and on-call quality. Qualifications Required Qualifications: Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Other Requirements Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Preferred Qualifications Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. #azurecorejobs This position will be open for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled. Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance with religious accommodations and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-25",
      "deadline_date": null,
      "location": "Bengaluru, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 17,
      "company": "Infosys",
      "job_title": "Python Developer",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4321900555",
      "job_description": "Programming: Python advance (Framework: Django) Angular or ReactJS desirable Exposure to RDBMS & NoSQL DB's Cloud Knowledge will be plus AI Skills: (Will be plus) PyTorch or TensorFlow Deep Learning (Neural Networks) Knowledge NLP – Transformers Should have experience to build best-fit architectural solution in form of frameworks/ tools in identified technology area Should be conversant with architecture principles and practices ( Architecture frameworks and methodology, Architecture patterns, Architect QoS ( performance, scalability, maintainability, reusability) Should be able to provide technical leadership and strategic direction for testing Should be able to create technology differentiation by contribution to new proposal/ pursuits Preferably should be aware of industry trends in some emerging technology areas (blockchain, AR-VR, LCNC, Quantum computing etc) Preferably a thought leaders within the area of technology specialization, esp for Sr. Tech Arch role (should have published some whitepapers or presented in some industry forums)",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-24",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 18,
      "company": "Infosys",
      "job_title": "Python, SQL, Dagster",
      "job_url": "https://in.linkedin.com/jobs/view/python-sql-dagster-at-infosys-4329531237",
      "job_description": "Primary skills:Technology->OpenSystem->Python - OpenSystem A day in the life of an Infoscion As part of the Infosys consulting team, your primary role would be to get to the heart of customer issues, diagnose problem areas, design innovative solutions and facilitate deployment resulting in client delight. You will develop a proposal by owning parts of the proposal document and by giving inputs in solution design based on areas of expertise. You will plan the activities of configuration, configure the product as per the design, conduct conference room pilots and will assist in resolving any queries related to requirements and solution design You will conduct solution/product demonstrations, POC/Proof of Technology workshops and prepare effort estimates which suit the customer budgetary requirements and are in line with organization's financial guidelines Actively lead small projects and contribute to unit-level and organizational initiatives with an objective of providing high quality value adding solutions to customers. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Ability to develop value-creating strategies and models that enable clients to innovate, drive growth and increase their business profitability Good knowledge on software configuration management systems Awareness of latest technologies and Industry trends Logical thinking and problem solving skills along with an ability to collaborate Understanding of the financial processes for various types of projects and the various pricing models available Ability to assess the current processes, identify improvement areas and suggest the technology solutions One or two industry domain knowledge Client Interfacing skills Project and Team management",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-28",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 19,
      "company": "Microsoft",
      "job_title": "Software Engineer",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4341285145",
      "job_description": "Overview Are you interested in working for one of the most exciting products in Microsoft, passionate about exceeding customer expectations and advancing Microsoft's cloud first strategy? Are you interested in a start-up like environment, excited about cloud computing technology and driving growth in one of Microsoft's core businesses? If so, then look no further than the Azure Customer Experience (CXP) Team! Microsoft Azure provides customers with an on-demand and infinitely scalable infrastructure and platform for customers to build, host, and scale service applications on the Internet through Microsoft's global data centers. As part of the Azure Engineering organization, Azure CXP is a rapidly growing team committed to driving Azure growth through our relentless pursuit of satisfied Azure customers, by leading world-class customer reliability engagements, engineering modern customer-first experiences for scale, and by driving deep customer insights and empathy into the broader Azure Engineering organization. Responsibilities Our team is looking for a Software Engineer to help develop a world-class, customer-centered engineering infrastructure. You will work with Azure CXP Program Managers and Data Scientists as well as other Azure engineering teams and the Field, Marketing and Support organizations to define and deliver critical, customer-facing features and the tools, infrastructure and end-to-end solutions required for all the rapidly expanding programs in Azure CXP. In this role, you will need strong customer empathy and an ability to focus our engineering efforts on Azure's business priorities. Please find the details of the responsibilities. Engineering Excellence Develops knowledge of and learns to apply best practices to reliably build code that is based on well-established methods. Develops an understanding of global and local regulations for technologies and system applications. Learns about customer scaling requirements and application of best practices for meeting scaling needs and performance expectations. Learns about and helps to support communication with key partners across the Microsoft ecosystem of engineers. Supports partner teams across Microsoft (e.g., Xbox, Office) and supports projects to drive and achieve desirable user experiences and fitting the dynamic needs of partners/customers through product development. Learns about and helps to ensure the correct processes are followed to achieve a high degree of security, privacy, safety, and accessibility. Contributes to efforts to check for visible evidence to demonstrate compliance for product features. Develops understanding of the implications of onboarding new technologies following expectations of compliance at Microsoft. Learns about, shares new ideas, and leverages software developer tools to create, debug, and maintain code for features. Uses internal tools and open source when possible. Learns to develop and contribute to automation within production and deployment of a product feature. Runs code in simulated, or other non-production environments to confirm functionality and error-free runtime for products with oversight. Reviews current developments and proactively seeks new knowledge that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale. Implement Learns to review work items to gain knowledge of product features in partnership with appropriate stakeholders (e.g., project managers). Assists and learns about breaking down work items into tasks and provides estimation. Escalates any issues that would cause a delay. Learns about and supports deployment to customers following the correct measures to push features out to customers. Learns about and considers the impact of build deployments on both users and other services. Learns about best practices for the deployment of features safely. Understand User Requirements Contributes in partnership with appropriate stakeholders (e.g., project manager, technical lead) to determine user requirements for a feature. Considers a variety of feedback channels to incorporate insights into future designs or solution fixes. Begins to incorporate appropriate continuous feedback loops measuring customer value, usage patterns, and other actionable metrics of value. Coding Learns to review code and helps to review code of others to ensure it meets the team's and Microsoft's quality standards. Participates in code review processes for self-development, gathers feedback, and learns about coding standards and the team's features. Applies coding patterns and best practices. With guidance, learns to create and implement code for a product, service, or feature reusing code as applicable. Writes and learns to create code that is extensible and maintainable. Learns about and applies diagnosability, reliability, and maintainability, and understands when the code is ready to be shared and delivered. Applies coding patterns and best practices to write code. Learns about and applies knowledge of debugging tools, logs, telemetry, and other methods to proactively flags issues before they occur and reactively flag issues as they occur for product features. Learns to conduct retrospective debugging of solutions to identify root causes of problems. Design Supports identification of dependencies, and the development of design documents for a product feature with oversight. Learns and helps to identify other teams and technologies that will be leveraged, how they will interact, and when one's system may provide support to others. Learns about back-end dependencies associated with product, application, service, or platform functionality for product features. Learns about downstream effects of solutions and work provided. Learns and contributes to processes for the architecture of a product/solution feature and learns to create proposals by testing design hypotheses and helping to refine code plans under the technical leadership of others. Produces code to test hypotheses for technical solutions and assists with technical validation efforts. Helps with and participates in the development of design documents for simple designs or User Stories with oversight, helps to determine the technology that will be leveraged, and how they will interact. Escalates findings from investigations to team members for design decisions. Learns about the implications of security and compliance requirements in systems architecture. Collaborates with others to create a clear and articulated plan for testing and assuring quality of solutions. Helps to augment test cases and assures that features have good test coverage. Learns to integrate automation into testing during planning where applicable. Reliability and Supportability Learns to contribute to efforts to collect, classify, and analyze data with some oversight on a range of metrics (e.g., health of the system, where bugs might be occurring). Contributes to the refinement and integration of feedback in product features by escalating findings from analyses to inform decisions regarding the engineering of products. Acts as a Designated Responsible Individual (DRI) in monitoring system/product feature/service for degradation, downtime, or interruptions for simple problems, and recommends actions to restore system/product/service by following the playbook. Escalates more complex problems to other DRIs as to status. Responds within Service Level Agreement (SLA) timeframe. Escalates issues to appropriate owners. Learns about and contributes to operations of live service as issues arise on a rotational, on-call basis. Identifies solutions and mitigations to simple issues impacting performance or functionality of Live Site services and escalates as necessary. Learns to contribute to efforts to integrate instrumentation for gathering telemetry data on system behavior such as performance, reliability, availability, usage, and safety mechanisms. Supports the maintenance of feedback loops from telemetry resulting in subsequent designs. Qualifications Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. 1+ years of experience with hands-on coding and designing distributed software systems 1+ years of experience in developing and delivering highly scalable distributed platform solutions Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Bachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. #azcxp Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work. This position will be open for a minimum of 5 days, with applications accepted on an ongoing basis until the position is filled. Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance with religious accommodations and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-24",
      "deadline_date": null,
      "location": "Hyderabad, Telangana, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:37:40",
      "updated_at": "2025-12-30 19:37:40"
    },
    {
      "job_id": 11,
      "company": "Infosys",
      "job_title": "Python Developer",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4321987124",
      "job_description": "Primary skills:Technology->Functional Testing->Mainframe testing->Proterm,Technology->Machine Learning->Python,Technology->OpenSystem->Python - OpenSystem Python A day in the life of an Infoscion As part of the Infosys consulting team, your primary role would be to lead the engagement effort of providing high-quality and value-adding consulting solutions to customers at different stages- from problem definition to diagnosis to solution design, development and deployment. You will review the proposals prepared by consultants, provide guidance, and analyze the solutions defined for the client business problems to identify any potential risks and issues. You will identify change Management requirements and propose a structured approach to client for managing the change using multiple communication mechanisms. You will also coach and create a vision for the team, provide subject matter training for your focus areas, motivate and inspire team members through effective and timely feedback and recognition for high performance. You would be a key contributor in unit-level and organizational initiatives with an objective of providing high-quality, value-adding consulting solutions to customers adhering to the guidelines and processes of the organization. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Good knowledge on software configuration management systems Strong business acumen, strategy and cross-industry thought leadership Awareness of latest technologies and Industry trends Logical thinking and problem solving skills along with an ability to collaborate Two or three industry domain knowledge Understanding of the financial processes for various types of projects and the various pricing models available Client Interfacing skills Knowledge of SDLC and agile methodologies Project and Team management",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-25",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 19:35:42",
      "updated_at": "2025-12-30 19:35:42"
    },
    {
      "job_id": 4,
      "company": "ALIQAN Technologies",
      "job_title": "Kafka Admin",
      "job_url": "https://in.linkedin.com/jobs/view/kafka-admin-at-aliqan-technologies-4249378270",
      "job_description": "Skills: Kafka, Apache Kafka, Kafka Streams, Kafka Connect, Shell Scripting, Linux Administration, Job Overview ALIQAN Technologies is seeking a skilled Kafka Admin for a mid-level contract position. The role is based in Bangalore, Chennai, or Pune. We are looking for candidates with 4 to 6 years of relevant work experience who can bring expertise in managing and optimizing Kafka ecosystems. Qualifications And Skills Must have a minimum of 4 years of working experience with Kafka (Mandatory skill). Proficiency with Apache Kafka for enterprise-grade applications (Mandatory skill). Expertise in Kafka Streams for real-time stream processing (Mandatory skill). Experience with Kafka Connect for data integration between Kafka and other systems. Proficient in shell scripting for managing and automating tasks in a Linux environment. A solid understanding of distributed systems and event-driven programming. Excellent problem-solving skills and the ability to troubleshoot issues quickly and effectively. Strong communication skills and capability to collaborate within cross-functional teams. Roles And Responsibilities Manage and administer Kafka clusters, ensuring their stability, performance, and security. Implement and manage Kafka stream processing solutions to meet business needs. Collaborate with development teams to integrate Kafka solutions with enterprise applications. Monitor and optimize Kafka performance, scalability, and reliability. Develop and maintain automation scripts to streamline Kafka operations and administrative tasks. Provide technical support and troubleshooting for Kafka-related issues. Ensure proper documentation of Kafka architecture, configurations, and operational procedures. Stay updated with the latest trends and advancements in Kafka technologies and propose improvements.",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-06-14",
      "deadline_date": null,
      "location": "Pune, Maharashtra, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 5,
      "company": "Tata Consultancy Services",
      "job_title": "Kafka Admin",
      "job_url": "https://in.linkedin.com/jobs/view/kafka-admin-at-tata-consultancy-services-4329379880",
      "job_description": "TCS has been a great pioneer in feeding the fire of young techies like you. We are a global leader in the technology arena and there's nothing that can stop us from growing together. What we are looking for Role: Kafka Admin Experience Range: 6 - 10 years Location: Chennai, Kolkata, Hyderabad, bangalore, Pune, Delhi Interview Mode: Telephonic Must Have: Kafka Administrator who should be able to perform complete admin work in Kafka and Unix activities. Designing, developing, and managing Kafka-based data pipelines. Working with other big data technologies such as Hadoop, Spark, and Storm. Monitoring and optimizing Kafka clusters. Troubleshooting Kafka related issues. Handling customer queries and support. Performing administrator support for Kafka infrastructure.. Good to Have: Maintaining the availability, performance and security of Kafka infrastructure. Developing and maintaining the automation for Kafka infrastructure. Creating and managing Kafka topics, producers, consumers, and Python-based Kafka consumers and producers to enable efficient data processing with other systems. Essential: Experience in other messaging systems such as IBM MQ or Rabbit MQ. Experience in the Atlassian stack tools Jira, Confluence and Bitbucket (GIT). Experience in Jenkins automation development. Experience in the scripting languages shell and python. Experience in the operating systems Linux (RedHat and/or SuSE) and Windows Server. Experience in search engines such as Elasticsearch. Minimum Qualification: •15 years of full-time education •Minimum percentile of 50% in 10th, 12th, UG & PG (if applicable)",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-29",
      "deadline_date": null,
      "location": "Bengaluru, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 6,
      "company": "Albertsons Companies India",
      "job_title": "Advanced Engineer Cloud - Kafka Admin [T500-18681]",
      "job_url": "https://in.linkedin.com/jobs/view/advanced-engineer-cloud-kafka-admin-t500-18681-at-albertsons-companies-india-4343143891",
      "job_description": "ANSR is hiring for one of our client About Albertsons Companies Inc.: As a leading food and drug retailer in the United States, Albertsons Companies, Inc. operates over 2,200 stores across 35 states and the District of Columbia. Our well-known banners across the United States, including Albertsons, Safeway, Vons, Jewel-Osco and others, serve more than 36 million U.S customers each week. We build and shape technology solutions that solve customers' problems every day, making things easier for them when they shop with us online or in a store. We have made bold, strategic moves to migrate and modernize our core foundational capabilities, positioning ourselves as the first fully cloud-based grocery tech company in the industry. Our success is built on a one-team approach, driven by the desire to understand and enhance the customer experience. By constantly pushing the boundaries of retail, we are transforming shopping into an experience that is easy, efficient, fun and engaging. About Albertsons Companies India: At Albertsons Companies India, we're not just pushing the boundaries of technology and retail innovation, we're cultivating a space where ideas flourish and careers thrive. Our workplace in India is a vital extension of the Albertsons Companies Inc. workforce and important to the next phase in the company's technology journey to support millions of customers' lives every day. At the Albertsons Companies India, we are raising the bar to grow across Technology & Engineering, AI, Digital and other company functions, and transform a 165-year-old American retailer. At Albertsons Companies India, associates collaborate directly with international teams, enhancing decision-making processes and organizational agility through exciting and pivotal projects. Your work will make history and help millions of lives each day come together around the joys of food and inspire their well-being. Position Title: Advanced Engineer Cloud - Kafka Admin & support What you will be doing: Kafka Administration and Support (Kafka / Streaming): Architect, build and maintain Kafka cluster on containers and VMs in multi-cloud Help Onboard application topics, connectors. Identify root causes/ debugging of problems and troubleshoot, considering both long and short-term impact of proposed solutions and developed workable solutions Monitor failures; help with message reprocessing. Manage Kafka operations, including VM, containers, connect cluster, cluster-linking health. Automate the daily operation related activities using ansible and Github. Co-ordinate with application teams to ensure the infrastructure is with the latest maintenance level. Perform upgrades and patching Ingest Kafka monitoring metrics to Grafana dashboard Enable Oauth and RBAC policy for applications Install certs, upgrade certs and enable SASL connectivity Main responsibilities: What we are searching for: Retail and / or grocery industry experience is strongly preferred. Expert on Kafka components, architecture and its implementation. Experience in schema registry operations Experience with operating on containers AKS and GKE Knowledge of various integration patterns, data transfer protocols Knowledge of integration with IBM MQ, dataflow, Azure data factory Hands-on experience with Kafka on containers and VMs We believe the successful candidate has these qualifications and experience: 4+ years of experience in Kafka Administration, and support. Experience in Confluent platform 7.x on containers is a big plus. Experience in Apache Kafka on containers a big plus. Experience building clusters using ci/cd tools Automation of repetitive tasks like topic creation, connector creation, rbac provisioning Experience with Schema registry and KSQL Experience with Ansible, cp-ansible. Experience in setting up DR / Active-Active clusters Experience with Cluster linking and Schema linking Able to troubleshoot producer and consumer issues and provides suggestions to developers on the tuning parameters Experience setting up various connectors: MQ, Jdbc, Splunk, BQ, Blob, etc. . Able to support high priority production issues and bring it closure and provide RCA & fix Experience with KSQL (Kafka streams) and Rest proxy Business Acumen & Communication: Skilled at understanding business challenges and translating them into solutions that create measurable impact. Prior collaboration experience with business teams to ensure effective integration with business applications. Excellent communication skills, capable of working with both technical and non-technical stakeholders. Ability to work independently while seeking direction when necessary.",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-11",
      "deadline_date": null,
      "location": "Bengaluru, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 7,
      "company": "Royal Cyber Inc.",
      "job_title": "IIB/MQ - Admin Senior Software Engineer",
      "job_url": "https://in.linkedin.com/jobs/view/iib-mq-admin-senior-software-engineer-at-royal-cyber-inc-3924696132",
      "job_description": "IIB Admin Should have strong knowledge in the following areas Perform installation and maintenance, environment configuration on windows, unix, aix platforms of IIB 9.x, 10.X and all versions of ACE. Hands-on exp with IBM Integration Bus administrative interfaces like web user interface and IIB commands interface back up and recovery, DR and HA setup(experience with RDQM, clustering and multi-instance mechanisms) secure access to resources and message flows, perform problem determination and resolution, and performance monitoring & tuning. Configuring connectivity to MQ, JMS provider, SFTP, & SupportPac components; Managing an integration node, message flow security, & global cache MQ or MQTT, workload management policies, & a database to record events & replay messages. MQ admin Should have spent most of the career in administering IBM Websphere MQ 7.1 to version 9.x experience in windows and Unix platforms. Should be able to independently perform product installation and maintenance, environment configuration, back up and recovery, DR and HA setup (experience with clustering, multi-instance & RDQM mechanisms). Proficiency in understanding the MQ architecture Should have in depth knowledge on MQ Infrastructure. Extensive experience in creating MQ objects as per the requirement, DQM setup, MQ cluster set up, Multi instance/ MQHA set up, Expert level knowledge on MQ SSL set up, SSL cert expiry/renewal process and troubleshoot certificate mismatch. Should have good knowledge on MQ Pub -Sub Set up Production Management for MQ plants- Deep-diving into complex troubleshoots, implementing changes, Good problem solving skills and the ability to multi-task effectively Rich Experience in Incident Management, Problem Management, SLA Proficiency in Linux and Networking Scripting Knowledge would be added advantage Should have knowledge on monitoring tools like Datadog, BMTC Qpasa, IBM Tivoli or Nastel Auto Pilot. Monitoring and configuration and other monitoring tools. Nice to have some experience on Apache Kafka / Confluent Kafka. Knoowledge on CICD/Devops process and tools, IIB/ACE admin, MQ on cloud, MQ Advanced and CloudPak are a plus",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2024-04-25",
      "deadline_date": null,
      "location": "Bengaluru, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 8,
      "company": "Mindera",
      "job_title": "Java Engineer - Shopify Integrations",
      "job_url": "https://in.linkedin.com/jobs/view/java-engineer-shopify-integrations-at-mindera-4338092285",
      "job_description": "About The Role We are looking for a Java Engineer with strong backend development experience and a passion for building scalable Shopify integrations. At Mindera, you will help design and deliver backend systems that power next-generation e-commerce experiences - connecting Shopify with enterprise platforms through well-architected APIs and event-driven designs. You will focus on architecture, API design, mentoring, and delivery - blending technical excellence with practical execution. This is a great opportunity for engineers who love crafting elegant systems, care about code quality, and enjoy solving real-world integration challenges. Key Responsibilities - Design and implement Java-based backend services (Micronaut preferred) for Shopify integration and related e- commerce workflows. Architect and document APIs using OpenAPI / AsyncAPI specifications, ensuring clarity, versioning, and scalability. Implement Shopify integration patterns including webhooks, event-driven communication, and synchronization of products, orders, and fulfillment. Build RESTful APIs and Kafka-based event pipelines, supporting reliable, decoupled services Apply domain-driven design (DDD) and event-driven architecture (EDA) to ensure maintainable and extensible codebases. Create and maintain reusable backend components (e.g., Catalogue Validator, Pricing Service, Notification Engine) Mentor junior developers in Java design principles, code reviews, and testing best practices Contribute to CI/CD pipelines, improving automation, observability, and release reliability Champion code quality, ensuring standards for linting, formatting, and secure coding are consistently Collaborate with cross-functional teams (frontend, QA, DevOps, and product) to deliver features end-to-end Requirements Core Technical Skills Backend Development: Java (8+) with frameworks like Micronaut (preferred) or Spring Boot Strong knowledge of Gradle, REST, and Kafka scaffolding Experience with service health checks, observability, and performance tuning API Design & Integration: Hands-on experience with OpenAPI / AsyncAPI documentation and design-first development Expertise in Shopify APIs (Admin API, Storefront API, Webhooks) Solid understanding of authentication, rate limiting, and API orchestration patterns Testing & Quality: Proficient with JUnit, Mockito, and Contract testing tools Strong emphasis on unit testing, mocking strategies, and code coverage metrics Experience with test data generation and automation frameworks Architecture & Patterns: Deep understanding of Domain-Driven Design (DDD) and Event-Driven Architecture (EDA) Ability to design modular, reusable components and shared libraries Experience designing resilient, scalable systems across distributed environments Dev Standards & Governance: Advocates for clean code principles - linting, formatting, and code review culture Applies secure coding and governance standards for enterprise-grade software Familiarity with CI/CD pipelines, GitHub Actions or Jenkins, and infrastructure as code (IaC) workflows Nice-to-Have Skills Experience with Shopify Plus, custom app development, or Shopify Functions Familiarity with Docker/Kubernetes and AWS cloud deployments applied to monitoring and alerting tools like Prometheus, Grafana, or New Relic. Prior involvement in mentoring teams, contributing to architecture discussions, and driving technical delivery Profile Hands-on engineer with a deep understanding of backend architecture and Shopify ecosystems Strong communicator who enjoys mentoring, guiding design discussions, and improving engineering quality Thrives in collaborative, agile environments - values autonomy, responsibility, and continuous improvement Passionate about building software that's both technically sound and business impactful We'd love to get to know you better! Benefits We Offer Fun, happy and politics-free work culture built on the principles of lean and self organisation; Work with large scale systems powering global businesses; Competitive salary and benefits About Mindera At Mindera we use technology to build products we are proud of, with people we love. Software Engineering Applications, including Web and Mobile, are at the core of what we do at Mindera. We partner with our clients, to understand their product and deliver high performance, resilient and scalable software systems that create an impact in their users and businesses across the world. You get to work with a bunch of great people, where the whole team owns the project together. Our culture reflects our lean and self-organisation attitude. We encourage our colleagues to take risks, make decisions, work in a collaborative way and talk to everyone to enhance communication. We are proud of our work and we love to learn all and everything while navigating through an Agile, Lean and collaborative environment. Follow our Linkedln page - https://tinyurl.com/minderaindia Check ot our Blog: http://mindera.com/ and our Handbook: http://bit.ly/MinderaHandbook Our offices are located: Aveiro, Portugal | Porto, Portugal | Leicester, UK | San Diego, USA | San Francisco, USA | Chennai, India | Bengaluru, India",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-11-07",
      "deadline_date": null,
      "location": "Chennai, Tamil Nadu, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 9,
      "company": "Commonwealth Bank",
      "job_title": "Principal Software Engineer",
      "job_url": "https://in.linkedin.com/jobs/view/principal-software-engineer-at-commonwealth-bank-4344132586",
      "job_description": "Organization: At CommBank, we never lose sight of the role we play in other people's financial wellbeing. Our focus is to help people and businesses move forward to progress. To make the right financial decisions and achieve their dreams, targets, and aspirations. Regardless of where you work within our organisation, your initiative, talent, ideas, and energy all contribute to the impact that we can make with our work. Together we can achieve great things. Job Title: Principal Software Engineer Location: Bangalore-Manyata Tech Park Business & Team: This role is part of the Service Crew within ITB Domain in Institutional Banking, where we deliver cutting-edge technology solutions that serve business & institutional customers across our relationship managed customer segments of the bank. Our mission is to empower businesses to thrive using the technology of tomorrow. By leveraging digital tools, our Crew aims to elevate the customer experience and deliver exceptional products and services. Impact & Contribution: As a Principal Engineer, you will play a pivotal role within our team. You'll bring your expertise in technology and Digital knowledge to define technical strategies and design innovative solutions for complex challenges within a business unit. Your approach will integrate a strong focus on risk management and security from the earliest stages of development. Additionally, you'll mentor and guide engineers, fostering excellence in their craft and enabling them to deliver world-class applications. Roles & Responsibilities: Will shape the future of our digital platform while focusing on designing, developing, and deploying innovative technology solutions that will enable us to build tomorrow's bank today. Use skills to lead our engineers in implementing complex technical solutions that may include SaaS and cloud-based environment experience. You'll possess a strong risk mindset in ensuring that appropriate cyber security controls are implemented and play a significant mentoring role in providing technical assistance to the engineers in the team. Enjoy and have demonstrable experience building enterprise software Have a broad technology background with engineering as a core competency Have experience building and leading teams through complex multi year builds ideally gained in a similar role within an enterprise environment or as a CTO in an ASX 200 organisation or scaleup Have real world experience of building and leading teams who operate in the DevSecOps model. Have experience of addressing Tech Debt using a commercially focused and pragmatic approach. Have identified, gained support and ensured execution of technical direction and strategy Can design and implement solutions to complex problems, including onboarding and migrating to new tooling as well as removing obsolete systems and code. Encourages risk-taking and constructively challenges the status quo while influencing stakeholders and building diverse and inclusive teams. Technology Skills: 18+ years of relevant hands on work experience in software development Thorough understanding of large-scale distributed systems, solution design and architecture principles Ability to design solutions to meet the highest possible quality standards while simultaneously balancing security, performance, availability, and maintainability concerns Developing 3-tier application both on-premises and on cloud covering: Frontend: React and Redux (preferred) or Angular. Backend: .Net Core (preferred), C#., Kafka, JavaScript APIs & Database: SQL and NoSQL experience (both admin and usage). Microservices design and implementation of highly scalable APIs. Solid technical background in building and designing data integration, microservices and workflow automation on cloud platforms using AWS Scripting/programming languages (i.e., JavaScript, TypeScript, Go, Python). Expertise in setting up DevSecOps, CI/CD pipelines, logging and monitoring tools (TeamCity, Octopus, GitHub, GitHub Actions, Artifactory, Snyk and SonarQube) Infrastructure as Code (Terraform or CloudFormation). Mentoring and coaching other Engineers. Configuration Management. Containerisation. Experience with AI engineering tools and frameworks Education Qualifications: Bachelor's degree or master's degree in engineering in Computer Science/Information Technology. If you're already part of the Commonwealth Bank Group (including Bankwest, x15ventures), you'll need to apply through Sidekick to submit a valid application. We're keen to support you with the next step in your career. We're aware of some accessibility issues on this site, particularly for screen reader users. We want to make finding your dream job as easy as possible, so if you require additional support please contact HR Direct on 1800 989 696. Advertising End Date: 30/01/2026",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-16",
      "deadline_date": null,
      "location": "Bengaluru East, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 10,
      "company": "Zinnia",
      "job_title": "Software Engineer III - AI Tools",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-iii-ai-tools-at-zinnia-4325374151",
      "job_description": "Who We Are Zinnia is the leading technology platform for accelerating life and annuities growth. With innovative enterprise solutions and data insights, Zinnia simplifies the experience of buying, selling, and administering insurance products. All of which enables more people to protect their financial futures. Our success is driven by a commitment to three core values: be bold, team up, deliver value – and that we do. Zinnia has over $180 billion in assets under administration, serves 100+ carrier clients, 2500 distributors and partners, and over 2 million policyholders. Who You Are Generative AI Engineer will be responsible to design, build, and operate production LLM systems—RAG services, eval/guardrail pipelines, and API integrations—used across the enterprise. What You'll Do Own backend services for GenAI features (Python/FastAPI or TypeScript/Node), from design to production. Build RAG pipelines end-to-end: chunking, embeddings, vector indexes, retrieval, reranking, grounding, and response synthesis. Build/extend MCP integrations for major internal applications and APIs. Implement LLM evaluation & guardrails: prompt/unit evals, Ragas, Langfuse, LangSmith, A/B tests, hallucination & safety checks, feedback loops. Stand up LLMOps/MLOps: CI/CD for models & prompts, dataset/version management, feature stores, tracing, monitoring, and cost controls. Create SDKs/REST/GraphQL integrations with internal systems; handle auth (OAuth/JWT), rate limits, retries, and backoff. Drive observability (metrics, tracing, logs), SLOs, and incident response; partner with SRE for reliability. Collaborate with product and security on requirements, data governance, and privacy-by-design. Mentor peers; raise code quality through reviews, design docs, and reusable components. What You'll Need Total 5-9 years of experience is required. Backend strength: Python (FastAPI, Pydantic, async) or TypeScript/Node (Express/Fastify/Next API routes); testing (pytest/jest), Git/PR hygiene, CI/CD. GenAI hands-on: LLM prompting/tool use, context management, streaming, and at least one RAG system taken to production (or a rigorous POC with metrics). Vector search: FAISS/pgvector/Pinecone/Weaviate/Milvus/Qdrant; embeddings pipelines; caching & cold-start strategies. Ops for AI: Practical MLOps/LLMOps/AIOps—model/prompt versioning, data contracts, evaluation harnesses, cost/perf monitoring, rollbacks. Cloud & infra: Docker, Kubernetes (or serverless), one major cloud (AWS/Azure/GCP), secrets management, IaC basics. Security & governance: PII handling, RBAC, audit trails, and least-privilege design. Nice to have LangChain/LlamaIndex/LangGraph, Agentic AI, OpenAI/Azure, Gemini, OpenAI/Bedrock/Vertex SDKs; MCP (Model Context Protocol) tools/adapters. Retrieval enhancements: hybrid search, re-rankers, prompt caching, toolformer/function calling. Data systems: PostgreSQL, Redis, Kafka/SQS; batch & streaming pipelines. Observability: OpenTelemetry, Prometheus, Grafana; latency/cost optimization. Basic frontend for internal tools (React/Next.js) to wire quick admin consoles. WHAT'S IN IT FOR YOU? At Zinnia, you collaborate with smart, creative professionals who are dedicated to delivering cutting-edge technologies, deeper data insights, and enhanced services to transform how insurance is done. Visit our website at www.zinnia.com for more information. Apply by completing the online application on the careers section of our website. We are an Equal Opportunity employer committed to a diverse workforce. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability.",
      "jd_file_path": null,
      "requirements_yaml": null,
      "posted_date": "2025-12-24",
      "deadline_date": null,
      "location": "Bengaluru, Karnataka, India",
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": "linkedin",
      "notes": null,
      "created_at": "2025-12-30 18:53:52",
      "updated_at": "2025-12-30 18:53:52"
    },
    {
      "job_id": 1,
      "company": "Uber",
      "job_title": "Kafka Administrator",
      "job_url": null,
      "job_description": "Kafka Administrator - Uber Technologies\n\nUber is seeking an experienced Kafka Administrator to join our Data Platform team.\n\nAbout the Role:\nYou will manage mission-critical Apache Kafka infrastructure powering real-time \ndata streaming for ride-hailing, food delivery, and freight operations globally.\n\nResponsibilities:\n• Manage and scale Apache Kafka clusters handling 10M+ messages per second\n• Design and implement topic architecture, partitioning strategies, and replication\n• Ensure 99.99% uptime through proactive monitoring and incident response\n• Implement security controls (SSL/TLS, SASL, Kerberos) for data protection\n• Perform capacity planning, cluster scaling, and performance optimization\n• Deploy and manage Kafka Connect for data integration pipelines\n• Configure Schema Registry for data governance and evolution\n• Automate operational tasks using Python, Bash, and infrastructure as code\n• Collaborate with data engineers and application teams on streaming solutions\n• Provide on-call support for production issues\n\nRequired Qualifications:\n• 3+ years hands-on experience with Apache Kafka or Confluent Platform\n• Deep understanding of distributed systems, replication, and consistency\n• Production experience with cluster management, monitoring, and troubleshooting\n• Strong Linux/Unix system administration skills\n• Experience with containerization (Docker, Kubernetes)\n• Proficiency in scripting (Python, Bash, Shell)\n• Knowledge of monitoring tools (Prometheus, Grafana, Datadog, Splunk)\n• Experience with CI/CD pipelines and automation\n• Strong problem-solving and debugging skills\n• Excellent communication and documentation abilities\n\nPreferred Qualifications:\n• Confluent Certified Kafka Administrator or Developer\n• Experience with Kafka Streams, ksqlDB, or Apache Flink\n• AWS, Azure, or GCP cloud platform experience\n• Experience with Terraform, Ansible, or similar IaC tools\n• Knowledge of message serialization (Avro, Protobuf, JSON Schema)\n• Experience with multi-datacenter replication and disaster recovery\n• Background in SRE or platform engineering\n• Open source contributions to Kafka ecosystem\n\nTechnical Environment:\n• Apache Kafka 3.x / Confluent Platform 7.x\n• Kubernetes, Docker, Helm\n• AWS (EC2, EBS, S3, CloudWatch)\n• Terraform, Ansible\n• Prometheus, Grafana, Datadog\n• Jenkins, GitLab CI/CD\n• Python, Bash\n\nWhat We Offer:\n• Competitive salary and equity\n• Health, dental, vision insurance\n• 401(k) with company match\n• Unlimited PTO\n• Remote-friendly (hybrid in SF office)\n• Learning and development budget\n• Work on massive scale (petabytes of data daily)\n\nLocation: San Francisco, CA (Hybrid - 2 days/week in office)\nSalary Range: $140,000 - $200,000 + equity\n\nTo Apply:\nSend resume to careers@uber.com with subject \"Kafka Administrator - [Your Name]\"\n\nUber is an equal opportunity employer.\n\n",
      "jd_file_path": "data/job_descriptions/kafka_admin_uber.txt",
      "requirements_yaml": null,
      "posted_date": null,
      "deadline_date": null,
      "location": null,
      "salary_range": null,
      "employment_type": null,
      "status": "active",
      "source": null,
      "notes": null,
      "created_at": "2025-12-30 15:46:39",
      "updated_at": "2025-12-30 15:46:39"
    }
  ],
  "variants": [
    {
      "variant_id": "4e8cf285-6062-4e35-92c1-dab747ec05d0",
      "job_id": 4,
      "base_resume_path": "data/resumes/my_resume.tex",
      "variant_latex_path": "data/resumes/variants/resume_ALIQAN_Technologies_kafka_admin_4e8cf285.tex",
      "variant_pdf_path": "data/resumes/variants/resume_ALIQAN_Technologies_kafka_admin_4e8cf285.pdf",
      "metadata_json_path": "data/resumes/variants/resume_ALIQAN_Technologies_kafka_admin_4e8cf285_metadata.json",
      "target_bullets": 11,
      "ai_enhancement_enabled": 1,
      "bullets_enhanced": 5,
      "total_bullets": 11,
      "keywords_added": [
        "apache kafka",
        "kafka streams",
        "kafka",
        "mandatory skill",
        "security"
      ],
      "generated_at": "2025-12-30 19:20:37",
      "pdf_path": "data/resumes/variants/resume_aliqan_technologies_kafka_admin_4e8cf285-6062-4e35-92c1-dab747ec05d0.pdf"
    },
    {
      "variant_id": "f66d47db-9b66-4539-bccb-e64bb45bf974",
      "job_id": 2,
      "base_resume_path": "data/resumes/my_resume.tex",
      "variant_latex_path": "data/resumes/variants/resume_Testing_kafka_admin_f66d47db.tex",
      "variant_pdf_path": "data/resumes/variants/resume_Testing_kafka_admin_f66d47db.pdf",
      "metadata_json_path": "data/resumes/variants/resume_Testing_kafka_admin_f66d47db_metadata.json",
      "target_bullets": 11,
      "ai_enhancement_enabled": 1,
      "bullets_enhanced": 5,
      "total_bullets": 11,
      "keywords_added": [
        "docker",
        "python",
        "kubernetes",
        "cluster management",
        "aws",
        "kafka"
      ],
      "generated_at": "2025-12-30 17:19:55",
      "pdf_path": null
    },
    {
      "variant_id": "1ce26574-86f2-47a6-b3f6-5771ab5891ea",
      "job_id": 1,
      "base_resume_path": "data/resumes/my_resume.tex",
      "variant_latex_path": "data/resumes/variants/resume_Uber_kafka_administrator_1ce26574.tex",
      "variant_pdf_path": "data/resumes/variants/resume_Uber_kafka_administrator_1ce26574.pdf",
      "metadata_json_path": "data/resumes/variants/resume_Uber_kafka_administrator_1ce26574_metadata.json",
      "target_bullets": 11,
      "ai_enhancement_enabled": 1,
      "bullets_enhanced": 5,
      "total_bullets": 11,
      "keywords_added": [
        "docker",
        "aws",
        "kafka",
        "kubernetes",
        "python"
      ],
      "generated_at": "2025-12-30 15:46:39",
      "pdf_path": "data/resumes/variants/resume_uber_kafka_administrator_1ce26574-86f2-47a6-b3f6-5771ab5891ea.pdf"
    }
  ],
  "pipeline": [
    {
      "job_id": 12,
      "company": "Infosys",
      "job_title": "Python Developer",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 13,
      "company": "Infosys",
      "job_title": "Python Developer",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 14,
      "company": "Infosys",
      "job_title": "Python Developer",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 15,
      "company": "Infosys",
      "job_title": "Python Devloper",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 16,
      "company": "Microsoft",
      "job_title": "Software Engineer",
      "location": "Bengaluru, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 17,
      "company": "Infosys",
      "job_title": "Python Developer",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 18,
      "company": "Infosys",
      "job_title": "Python, SQL, Dagster",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 19,
      "company": "Microsoft",
      "job_title": "Software Engineer",
      "location": "Hyderabad, Telangana, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 11,
      "company": "Infosys",
      "job_title": "Python Developer",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 4,
      "company": "ALIQAN Technologies",
      "job_title": "Kafka Admin",
      "location": "Pune, Maharashtra, India",
      "job_status": "active",
      "variants_generated": 1,
      "applications_count": 0,
      "best_ats_score": 75.39873417721518,
      "last_applied_date": null
    },
    {
      "job_id": 5,
      "company": "Tata Consultancy Services",
      "job_title": "Kafka Admin",
      "location": "Bengaluru, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 6,
      "company": "Albertsons Companies India",
      "job_title": "Advanced Engineer Cloud - Kafka Admin [T500-18681]",
      "location": "Bengaluru, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 7,
      "company": "Royal Cyber Inc.",
      "job_title": "IIB/MQ - Admin Senior Software Engineer",
      "location": "Bengaluru, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 8,
      "company": "Mindera",
      "job_title": "Java Engineer - Shopify Integrations",
      "location": "Chennai, Tamil Nadu, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 9,
      "company": "Commonwealth Bank",
      "job_title": "Principal Software Engineer",
      "location": "Bengaluru East, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 10,
      "company": "Zinnia",
      "job_title": "Software Engineer III - AI Tools",
      "location": "Bengaluru, Karnataka, India",
      "job_status": "active",
      "variants_generated": 0,
      "applications_count": 0,
      "best_ats_score": null,
      "last_applied_date": null
    },
    {
      "job_id": 1,
      "company": "Uber",
      "job_title": "Kafka Administrator",
      "location": null,
      "job_status": "active",
      "variants_generated": 1,
      "applications_count": 0,
      "best_ats_score": 54.70000000000002,
      "last_applied_date": null
    }
  ],
  "active_applications": []
}